По заданной дате требуется определить, какое число будет послезавтра.

Напомним, что год является високосным, если его номер кратен 4, но не кратен 100, а также если он кратен 400.

Формат ввода
Дано число, месяц и год (год  – число в промежутке от 1 до 10000).

Формат вывода
Требуется вывести, какое число будет послезавтра, в формате входных данных.4

#include <iostream>


using namespace std;


int main() {
    int a, b, c;
    cin >> a >> b >> c;
    for (int i = 0; i < 2; i++) {
        if (a == 31 && b == 12) {
            a = 1;
            b = 1;
            c++;
        } else if (a == 31 && b == 1) {
            a = 1;
            b++;
        } else if (a == 29 && b == 2) {
            a = 1;
            b++;
        } else if (a == 28 && b == 2) {
            if (c % 400 == 0 || (c % 4 == 0 && c % 100 != 0)) {
                a = 29;
            } else {
                a = 1;
                b++;
            }
        } else if (a == 31 && b == 3) {
            a = 1;
            b++;
        } else if (a == 30 && b == 4) {
            a = 1;
            b++;
        } else if (a == 31 && b == 5) {
            a = 1;
            b++;
        } else if (a == 30 && b == 6) {
            a = 1;
            b++;
        } else if (a == 31 && b == 7) {
            a = 1;
            b++;
        } else if (a == 31 && b == 8) {
            a = 1;
            b++;
        } else if (a == 30 && b == 9) {
            a = 1;
            b++;
        } else if (a == 31 && b == 10) {
            a = 1;
            b++;
        } else if (a == 30 && b == 11) {
            a = 1;
            b++;
        } else {
            a++;
        }
    }
    cout << a << " " << b << " " << c;
    return 0;
}
